<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Country;
use App\Models\Region;
use App\Models\City;
class RegionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $saudi = Country::where('iso_code', 'SA')->firstOrFail();
        $data = [
            'الرياض'=> [
                'الرياض','الخرج','الدرعية','الدوادمي','المجمعة','شقراء',
                'القويعية','وادي الدواسر','الزلفي','الأفلاج','حوطة بني تميم',
                'السليل','الغاط','ثادق','حريملاء','رماح','ضرما','المزاحمية'
            ],

            'مكة المكرمة'=> [
                'مكة المكرمة','جدة','الطائف','القنفذة','الليث','رابغ',
                'خليص','الجموم','الكامل','تربة','رنية','الخرمة','بحرة'
            ],

            'المدينة المنورة'=> [
                'المدينة المنورة','ينبع','العلا','المهد','بدر','خيبر',
                'الحناكية','وادي الفرع','العيص'
            ],

            'المنطقة الشرقية'=> [
                'الدمام','الخبر','الظهران','الأحساء','القطيف','الجبيل',
                'حفر الباطن','الخفجي','رأس تنورة','بقيق','النعيرية','قرية العليا'
            ],

            'عسير'=> [
                'أبها','خميس مشيط','بيشة','محايل عسير','النماص','بلقرن',
                'ظهران الجنوب','سراة عبيدة','رجال ألمع','تثليث','بارق','تنومة'
            ],

            'تبوك'=> [
                'تبوك','ضباء','الوجه','أملج','حقل','تيماء','البدع'
            ],

            'حائل'=> [
                'حائل','بقعاء','الغزالة','الشنان','سميراء','موقق'
            ],

            'الحدود الشمالية'=> [
                'عرعر','رفحاء','طريف','العويقيلة'
            ],

            'جازان'=> [
                'جازان','صبيا','أبو عريش','صامطة','الدرب','بيش',
                'أحد المسارحة','الحرث','فيفا','العارضة','الريث'
            ],

            'نجران'=> [
                'نجران','شرورة','حبونا','بدر الجنوب','ثار','يدمة'
            ],

            'الباحة'=> [
                'الباحة','بلجرشي','المندق','المخواة','قلوة','الحجرة','غامد الزناد'
            ],

            'الجوف'=> [
                'سكاكا','دومة الجندل','القريات','طبرجل'
            ],

            'القصيم'=> [
                'بريدة','عنيزة','الرس','البكيرية','المذنب','البدائع','عيون الجواء'
            ],

        ];

        foreach ($data as $regionName => $cities) {

            $region = Region::updateOrCreate(
                [
                    'country_id'=> $saudi->id,
                    'name'=> $regionName
                ]
            );

            foreach ($cities as $city) {
                City::updateOrCreate(
                    [
                        'region_id'=> $region->id,
                        'name'=> $city
                    ]
                );
            }
        }
    }
}
